Repository: EternalTimes/wslcontainerdesktop
Catalog: src/WslContainerDesktop/Strings/*/Resources.resw
Source language: en_us
Languages: zh_hans

# Workload_Text_Docker_Hub_names_start_with_your_18221c
source: Docker Hub names start with your Docker Hub username, for example yourname/
zh_hans: Docker Hub 名称以您的 Docker Hub 用户名开头，例如 yourname/

# Workload_Text_Dockerfile_optional_relative_to_the_folder_6c47c0
source: Dockerfile (optional, relative to the folder)
zh_hans: Dockerfile（可选，相对于文件夹）

# Workload_Text_Downgrade_not_supported_0748a2
source: Downgrade not supported
zh_hans: 不支持降级

# Workload_Text_Download_model_9979be
source: Download model
zh_hans: 下载模型

# Workload_Text_Downloading_0_this_can_take_several_8294ec
source: Downloading {0}… this can take several minutes.
zh_hans: 正在下载 {0}…可能需要几分钟。

# Workload_Text_Driver_options_one_key_value_per_0d7e76
source: Driver options (one key=value per line)
zh_hans: 驱动选项（每行一个 key=value）

# Workload_Text_Duplicate_0_3afa7b
source: Duplicate {0}
zh_hans: 复制 {0}

# Workload_Text_Duplicate_5d2022
source: Duplicate…
zh_hans: 复制…

# Workload_Text_Edit_0_fdd9d5
source: Edit {0}
zh_hans: 编辑 {0}

# Workload_Text_Edit_2b8a1a
source: Edit…
zh_hans: 编辑…

# Workload_Text_Edit_ports_images_environment_or_credentials_4d6b62
source: Edit ports, images, environment, or credentials as needed. Saving stores these changes so the template's Launch button reuses them, then imports and brings the project up.
zh_hans: 可按需编辑端口、镜像、环境变量或凭据。保存会记录这些变更，以便模板的“启动”按钮重复使用，然后导入并启动项目。

# Workload_Text_Enable_health_monitoring_817f4e
source: Enable health monitoring
zh_hans: 启用健康监控

# Workload_Text_Engine_default_1_never_kills_035f40
source: Engine default; -1 never kills
zh_hans: 引擎默认值；-1 表示永不强制终止

# Workload_Text_Enter_a_model_name_like_llama3_283218
source: Enter a model name like llama3.2:3b or qwen2.5:7b.
zh_hans: 请输入模型名称，例如 llama3.2:3b 或 qwen2.5:7b。

# Workload_Text_Enter_a_name_for_the_image_cd0692
source: Enter a name for the image, for example myapp:latest.
zh_hans: 请输入镜像名称，例如 myapp:latest。

# Workload_Text_Enter_a_network_name_d93a83
source: Enter a network name.
zh_hans: 请输入网络名称。

# Workload_Text_Enter_a_profile_name_before_saving_3c1897
source: Enter a profile name before saving.
zh_hans: 保存前请先输入配置名称。

# Workload_Text_Enter_an_image_before_saving_a_74526e
source: Enter an image before saving a profile.
zh_hans: 保存运行配置前请先输入镜像。

# Workload_Text_Enter_the_folder_that_contains_your_0376dd
source: Enter the folder that contains your Dockerfile.
zh_hans: 请输入包含 Dockerfile 的文件夹。

# Workload_Text_Enter_the_path_inside_the_container_a6f12a
source: Enter the path inside the container
zh_hans: 添加

# Workload_Text_Environment_one_per_line_KEY_VALUE_bfc3bb
source: Environment (one per line, KEY=VALUE)
zh_hans: 环境变量（每行一个 KEY=VALUE）

# Workload_Text_Environment_variables_0_6d6b79
source: Environment variables: {0}
zh_hans: 环境变量：{0}

# Workload_Text_Environment_variables_one_KEY_VALUE_per_73ca3b
source: Environment variables (one KEY=VALUE per line)
zh_hans: 环境变量（每行一个 KEY=VALUE）

# Workload_Text_Error_54a0e8
source: Error
zh_hans: 错误

# Workload_Text_Every_replica_count_must_be_a_b03ed1
source: Every replica count must be a nonnegative whole number.
zh_hans: 每个副本数都必须为非负整数。

# Workload_Text_Export_4a4c59
source: Export…
zh_hans: 导出…

# Workload_Text_Export_all_514276
source: Export all
zh_hans: 全部导出

# Workload_Text_Export_all_custom_templates_b20b13
source: Export all custom templates
zh_hans: 导出所有自定义模板

# Workload_Text_Export_your_custom_and_imported_templates_523a5d
source: Export your custom and imported templates to a file
zh_hans: 将自定义和导入的模板导出到文件

# Workload_Text_Exported_0_to_1_4d3931
source: Exported "{0}" to {1}.
zh_hans: 已将“{0}”导出到 {1}。

# Workload_Text_Exported_your_custom_templates_to_0_d8175b
source: Exported your custom templates to {0}.
zh_hans: 已将自定义模板导出到 {0}。

# Workload_Text_Failed_031a8f
source: Failed
zh_hans: 失败

# Workload_Text_Failed_to_start_99ef15
source: Failed to start
zh_hans: 启动失败

# Workload_Text_Failed_to_stop_6408b3
source: Failed to stop
zh_hans: 停止失败

# Workload_Text_Features_0_c0d50f
source: Features: {0}
zh_hans: 功能：{0}

# Workload_Text_Filter_repositories_ca86ca
source: Filter repositories…
zh_hans: 筛选仓库…

# Workload_Text_Folder_to_build_contains_your_Dockerfile_06d592
source: Folder to build (contains your Dockerfile)
zh_hans: 构建文件夹（包含 Dockerfile）

# Workload_Text_Forward_a_port_c39bd3
source: Forward a port
zh_hans: 转发端口

# Workload_Text_Forward_f1c65e
source: Forward
zh_hans: 转发

# Workload_Text_Gateway_optional_9a3176
source: Gateway (optional)
zh_hans: 网关（可选）

# Workload_Text_Getting_an_access_token_from_Azure_59ed81
source: Getting an access token from Azure…
zh_hans: 正在从 Azure 获取访问令牌…

# Workload_Text_Go_to_Registries_to_sign_in_06b3b9
source: Go to Registries to sign in
zh_hans: 前往“镜像仓库”页面登录

# Workload_Text_HOSTS_c44fdb
source: HOSTS
zh_hans: 主机

# Workload_Text_Health_check_0_5d0e6d
source: Health check · {0}
zh_hans: 健康检查 · {0}

# Workload_Text_Healthy_7f1e32
source: Healthy
zh_hans: 健康

# Workload_Text_Hide_ac20a5
source: Hide
zh_hans: 隐藏

# Workload_Text_Hide_log_163de9
source: Hide log
zh_hans: 隐藏日志

# Workload_Text_Host_initializeCommand_scripts_are_blocked_for_466c5e
source: Host initializeCommand scripts are blocked for Compose dev containers.
zh_hans: Compose 开发容器禁用主机 initializeCommand 脚本。

# Workload_Text_Host_initializeCommand_scripts_require_separate_Windows_fa813f
source: Host initializeCommand scripts require separate Windows host execution approval on every start or rebuild. Importing does not approve them.
zh_hans: 每次启动或重新构建时，主机 initializeCommand 脚本都需要单独批准在 Windows 主机上执行。导入并不会批准这些脚本。

# Workload_Text_Host_port_to_connect_to_3a2955
source: Host port to connect to
zh_hans: 要连接的主机端口

# Workload_Text_How_to_install_a_distribution_219fc7
source: How to install a distribution
zh_hans: 如何安装发行版

# Workload_Text_IP_range_optional_CIDR_within_the_205cbd
source: IP range (optional, CIDR within the subnet)
zh_hans: IP 范围（可选，子网内的 CIDR）

# Workload_Text_IPv4_address_must_be_a_valid_6ae20f
source: IPv4 address must be a valid IPv4 literal.
zh_hans: IPv4 地址必须为有效的 IPv4 地址。

# Workload_Text_IPv4_address_optional_540519
source: IPv4 address (optional)
zh_hans: IPv4 地址（可选）

# Workload_Text_Icon_glyph_5a4a54
source: Icon glyph
zh_hans: 图标字符

# Workload_Text_Image_0_839493
source: Image: {0}
zh_hans: 镜像：{0}

# Workload_Text_Image_name_52493e
source: Image name
zh_hans: 镜像名称

# Workload_Text_Image_reference_24f4a4
source: Image reference
zh_hans: 镜像引用

# Workload_Text_Import_0_template_s_into_your_67ba38
source: Import {0} template(s) into your gallery? Anything that clashes with an existing template is imported as a separate copy — nothing is overwritten.
zh_hans: 将 {0} 个模板导入模板库吗？与现有模板冲突的内容会作为独立副本导入，不会覆盖现有模板。

# Workload_Text_Import_2cff9b
source: Import
zh_hans: 导入

# Workload_Text_Import_Compose_project_d389da
source: Import Compose project
zh_hans: 导入 Compose 项目

# Workload_Text_Import_Dev_Container_1af7e9
source: Import Dev Container
zh_hans: 导入开发容器

# Workload_Text_Import_anyway_e06eac
source: Import anyway
zh_hans: 仍然导入

# Workload_Text_Import_compose_file_7279fc
source: Import compose file
zh_hans: 导入 Compose 文件

# Workload_Text_Import_failed_0a26f4
source: Import failed
zh_hans: 导入失败

# Workload_Text_Import_from_docker_run_8ad3ed
source: Import from docker run
zh_hans: 从 docker run 导入

# Workload_Text_Import_only_c9bd79
source: Import only
zh_hans: 仅导入

# Workload_Text_Import_templates_243230
source: Import templates
zh_hans: 导入模板

# Workload_Text_Import_templates_91deef
source: Import templates?
zh_hans: 导入模板吗？

# Workload_Text_Import_templates_from_a_file_9fc55e
source: Import templates from a file
zh_hans: 从文件导入模板

# Workload_Text_Import_the_project_anyway_83f426
source: Import the project anyway?
zh_hans: 仍要导入项目吗？

# Workload_Text_Imported_0_94041e
source: Imported "{0}"
zh_hans: 已导入“{0}”

# Workload_Text_Imported_0_template_s_6e2106
source: Imported {0} template(s).
zh_hans: 已导入 {0} 个模板。

# Workload_Text_Imported_from_docker_run_Notes_7e3213
source: Imported from docker run. Notes:
zh_hans: 已从 docker run 导入。说明：

# Workload_Text_Imported_project_0_1dff8a
source: Imported project "{0}"
zh_hans: 已导入项目“{0}”

# Workload_Text_Ingress_d830dd
source: Ingress
zh_hans: 入口

# Workload_Text_Ingresses_26d715
source: Ingresses
zh_hans: 入口

# Workload_Text_Install_569ca4
source: Install
zh_hans: 安装

# Workload_Text_Install_Kubernetes_0f8576
source: Install Kubernetes
zh_hans: 安装 Kubernetes

# Workload_Text_Install_Kubernetes_k3s_dc0765
source: Install Kubernetes (k3s)
zh_hans: 安装 Kubernetes（k3s）

# Workload_Text_Install_a_lightweight_single_node_Kubernetes_9daae2
source: Install a lightweight single-node Kubernetes cluster (k3s) that runs inside your WSL distro. It uses its own container runtime, installs as a service, and can be fully uninstalled at any time.
zh_hans: 安装在 WSL 发行版中运行的轻量级单节点 Kubernetes 集群（k3s）。它使用独立的容器运行时，以服务形式安装，随时可以完整卸载。

# Workload_Text_Install_failed_33b471
source: Install failed
zh_hans: 安装失败

# Workload_Text_Install_the_Azure_CLI_ea3717
source: Install the Azure CLI
zh_hans: 安装 Azure CLI

# Workload_Text_Installed_version_0_15ee25
source: Installed version: {0}
zh_hans: 已安装版本：{0}

# Workload_Text_Installing_k3s_0_9cb7e1
source: Installing k3s {0}…
zh_hans: 正在安装 k3s {0}…

# Workload_Text_Installing_k3s_this_can_take_a_63291c
source: Installing k3s… this can take a few minutes.
zh_hans: 正在安装 k3s…可能需要几分钟。

# Workload_Text_Internal_network_internal_7c7e70
source: Internal network (--internal)
zh_hans: 内部网络（--internal）

# Workload_Text_Invalid_key_0_Keys_cannot_be_062b6d
source: Invalid key '{0}'. Keys cannot be blank, contain '=', or contain control characters.
zh_hans: 无效的键“{0}”。键不能为空，不能包含“=”或控制字符。

# Workload_Text_Invalid_key_value_entry_16c85f
source: Invalid key/value entry.
zh_hans: 无效的键值项。

# Workload_Text_Invalid_value_for_0_Use_key_981fe2
source: Invalid value for '{0}'. Use key=value and avoid control characters.
zh_hans: “{0}”的值无效。请使用 key=value 格式，不要包含控制字符。

# Workload_Text_It_runs_as_a_systemd_service_07d477
source: It runs as a systemd service and can be uninstalled later. Continue?
zh_hans: 它将作为 systemd 服务运行，以后可卸载。继续吗？

# Workload_Text_Job_ad617a
source: Job
zh_hans: 任务

# Workload_Text_Job_started_514ca6
source: Job started
zh_hans: 任务已启动

# Workload_Text_Jobs_2f17a0
source: Jobs
zh_hans: 任务

# Workload_Text_KEYS_3fca50
source: KEYS
zh_hans: 键数

# Workload_Text_KIND_ae97bc
source: KIND
zh_hans: 资源类型

# Workload_Text_Keep_STDIN_open_i_780e70
source: Keep STDIN open (-i)
zh_hans: 保持 STDIN 开启（-i）

# Workload_Text_Kube_417c6a
source: Kube
zh_hans: 清单

# Workload_Text_Kubernetes_k3s_is_not_installed_7dc35f
source: Kubernetes (k3s) is not installed.
zh_hans: 尚未安装 Kubernetes（k3s）。

# Workload_Text_Kubernetes_needs_systemd_dbce45
source: Kubernetes needs systemd
zh_hans: Kubernetes 需要 systemd

# Workload_Text_Labels_one_key_value_per_line_f7aa78
source: Labels (one key=value per line)
zh_hans: 标签（每行一个 key=value）

# Workload_Text_Latest_stable_0_19df99
source: Latest stable ({0})
zh_hans: 最新稳定版（{0}）

# Workload_Text_Latest_stable_0_an_upgrade_is_b786cd
source: Latest stable: {0} — an upgrade is available.
zh_hans: 最新稳定版：{0} — 有可用升级。

# Workload_Text_Latest_stable_0_you_re_up_5dbd92
source: Latest stable: {0} — you're up to date. Re-running will reinstall the same version.
zh_hans: 最新稳定版：{0} — 已是最新。重新执行将重新安装相同版本。

# Workload_Text_Latest_stable_ad00d5
source: Latest stable
zh_hans: 最新稳定版

# Workload_Text_Latest_stable_could_not_be_determined_2b934d
source: Latest stable: could not be determined (no network?). You can still pin a specific version.
zh_hans: 无法确定最新稳定版（可能没有网络）。仍可指定具体版本。

# Workload_Text_Launch_another_c189f3
source: Launch another
zh_hans: 再启动一个

# Workload_Text_Launch_another_one_It_runs_alongside_a9e08c
source: Launch another one? It runs alongside the existing deployment as "{0}", with its own ports and its own data volumes, so neither can affect the other's data. {1} To replace the existing deployment instead, remove it first.
zh_hans: 再启动一个部署吗？它将以“{0}”与现有部署同时运行，使用独立的端口和数据卷，因此彼此不会影响数据。 {1} 如需替换现有部署，请先移除它。

# Workload_Text_Launch_cancelled_c36806
source: Launch cancelled.
zh_hans: 启动已取消。

# Workload_Text_Launch_ccf56e
source: Launch
zh_hans: 启动

# Workload_Text_Launch_failed_1755d5
source: Launch failed
zh_hans: 启动失败

# Workload_Text_Launching_0_3dad1d
source: Launching {0}…
zh_hans: 正在启动 {0}…

# Workload_Text_Launching_a6f90e
source: Launching…
zh_hans: 正在启动…

# Workload_Text_Lifecycle_ffd469
source: Lifecycle:
zh_hans: 生命周期：

# Workload_Text_Lifecycle_log_186b74
source: Lifecycle log
zh_hans: 生命周期日志

# Workload_Text_List_the_images_available_in_this_b363bc
source: List the images available in this registry
zh_hans: 列出此镜像仓库中可用的镜像

# Workload_Text_Loading_compose_projects_33a0b7
source: Loading compose projects…
zh_hans: 正在加载 Compose 项目…

# Workload_Text_Loading_container_registries_92b291
source: Loading container registries…
zh_hans: 正在加载容器镜像仓库…

# Workload_Text_Loading_dev_containers_c83356
source: Loading dev containers…
zh_hans: 正在加载开发容器…

# Workload_Text_Loading_repositories_460ca9
source: Loading repositories…
zh_hans: 正在加载仓库…

# Workload_Text_Loading_tags_for_0_2934a8
source: Loading tags for {0}…
zh_hans: 正在加载 {0} 的标签…

# Workload_Text_Local_port_0_is_already_being_ee8135
source: Local port {0} is already being forwarded.
zh_hans: 本地端口 {0} 已在转发中。

# Workload_Text_Local_port_9bc348
source: Local port
zh_hans: 本地端口

# Workload_Text_Log_in_c18984
source: Log in
zh_hans: 登录

# Workload_Text_Log_in_to_0_78a87c
source: Log in to {0}
zh_hans: 登录 {0}

# Workload_Text_Log_in_to_this_registry_now_510d38
source: Log in to this registry now
zh_hans: 立即登录此镜像仓库

# Workload_Text_Logs_ea2100
source: Logs
zh_hans: 日志

# Workload_Text_Manage_services_0_cdca2c
source: Manage services: {0}
zh_hans: 管理服务：{0}

# Workload_Text_Manage_services_8542ea
source: Manage services
zh_hans: 管理服务

# Workload_Text_Manifest_applied_716a5c
source: Manifest applied
zh_hans: 已应用清单

# Workload_Text_Manifest_applied_c4a4ae
source: Manifest applied.
zh_hans: 已应用清单。

# Workload_Text_Model_5e2c61
source: Model
zh_hans: 模型

# Workload_Text_More_actions_f8d46c
source: More actions
zh_hans: 更多操作

# Workload_Text_Mount_at_18caee
source: Mount at
zh_hans: 挂载位置

# Workload_Text_NAMESPACE_b6b685
source: NAMESPACE
zh_hans: 命名空间

# Workload_Text_NAME_eaa589
source: NAME
zh_hans: 名称

# Workload_Text_Name_0_c45829
source: Name: {0}
zh_hans: 名称：{0}

# Workload_Text_Name_dcd1d5
source: Name
zh_hans: 名称

# Workload_Text_Name_in_the_registry_c5e56f
source: Name in the registry
zh_hans: 镜像仓库中的名称

# Workload_Text_Name_optional_e09b37
source: Name (optional)
zh_hans: 名称（可选）

# Workload_Text_Name_this_project_8a5ddc
source: Name this project
zh_hans: 为项目命名

# Workload_Text_Namespace_b22b06
source: Namespace:
zh_hans: 命名空间：

# Workload_Text_Network_1744b9
source: Network
zh_hans: 网络

# Workload_Text_Network_attention_f45fdf
source: - Network attention:
zh_hans: - 网络需要注意：

# Workload_Text_Network_name_b97af0
source: Network name
zh_hans: 网络名称

# Workload_Text_New_template_30d87e
source: New template
zh_hans: 新建模板

# Workload_Text_No_Kubernetes_cluster_yet_371050
source: No Kubernetes cluster yet
zh_hans: 尚无 Kubernetes 集群

# Workload_Text_No_active_port_forwards_Click_Forward_e127b9
source: No active port forwards. Click "Forward a port" to expose a pod or service on localhost.
zh_hans: 没有活动的端口转发。点击“转发端口”可将 Pod 或服务开放到 localhost。

# Workload_Text_No_compose_projects_Import_a_docker_ebe1aa
source: No compose projects. Import a docker-compose.yml to get started.
zh_hans: 没有 Compose 项目。导入 docker-compose.yml 以开始使用。

# Workload_Text_No_compose_projects_Import_one_to_5185a1
source: No compose projects. Import one to get started.
zh_hans: 没有 Compose 项目。请先导入项目。

# Workload_Text_No_container_changes_are_required_979b3a
source: No container changes are required.
zh_hans: 无需更改容器。

# Workload_Text_No_container_registries_were_found_in_c14e91
source: No container registries were found in this subscription.
zh_hans: 此订阅中未找到容器镜像仓库。

# Workload_Text_No_cronjobs_51b199
source: No cronjobs.
zh_hans: 没有定时任务。

# Workload_Text_No_dev_containers_Open_a_workspace_3fac89
source: No dev containers. Open a workspace folder to import one.
zh_hans: 没有开发容器。打开工作区文件夹以导入容器。

# Workload_Text_No_file_selected_26bfbd
source: No file selected
zh_hans: 尚未选择文件

# Workload_Text_No_forwarded_ports_b75594
source: No forwarded ports
zh_hans: 没有转发端口

# Workload_Text_No_ingresses_d3ff45
source: No ingresses.
zh_hans: 没有入口。

# Workload_Text_No_jobs_66f528
source: No jobs.
zh_hans: 没有任务。

# Workload_Text_No_lifecycle_output_yet_4043c0
source: No lifecycle output yet.
zh_hans: 尚无生命周期输出。

# Workload_Text_No_persistent_volume_claims_e21f1c
source: No persistent volume claims.
zh_hans: 没有持久卷声明。

# Workload_Text_No_repositories_were_found_in_this_945b7b
source: No repositories were found in this registry.
zh_hans: 此镜像仓库中未找到仓库。

# Workload_Text_No_service_actions_were_performed_c99eee
source: No service actions were performed.
zh_hans: 未执行任何服务操作。

# Workload_Text_No_services_76de88
source: No services
zh_hans: 没有服务

# Workload_Text_No_services_with_an_image_were_ffb50a
source: No services with an image were found in the compose file.
zh_hans: Compose 文件中没有包含镜像的服务。

# Workload_Text_No_tags_were_found_for_0_eb50fa
source: No tags were found for {0}.
zh_hans: 未找到 {0} 的标签。

# Workload_Text_No_warnings_3a1134
source: No warnings
zh_hans: 没有警告

# Workload_Text_Node_af0374
source: Node:
zh_hans: 节点：

# Workload_Text_Node_e93372
source: Node
zh_hans: 节点

# Workload_Text_Nodes_7ac362
source: Nodes
zh_hans: 节点

# Workload_Text_None_dc937b
source: None
zh_hans: 无

# Workload_Text_None_keep_it_on_this_PC_3f35de
source: None — keep it on this PC
zh_hans: 不推送，仅保留在此计算机上

# Workload_Text_Not_captured_a_running_container_doesn_868de2
source: Not captured (a running container doesn't expose these):
zh_hans: 未获取（运行中的容器不提供这些内容）：

# Workload_Text_Not_installed_d177cd
source: Not installed
zh_hans: 未安装

# Workload_Text_Not_running_0_0_instances_e67878
source: Not running (0/{0} instances)
zh_hans: 未运行（0/{0} 个实例）

# Workload_Text_Not_running_9e3856
source: Not running
zh_hans: 未运行

# Workload_Text_Note_optional_f9b73e
source: Note (optional)
zh_hans: 备注（可选）

# Workload_Text_Nothing_to_export_fd3032
source: Nothing to export
zh_hans: 没有可导出的内容

# Workload_Text_Nothing_to_import_c4497f
source: Nothing to import
zh_hans: 没有可导入的内容

# Workload_Text_Nothing_to_launch_e88455
source: Nothing to launch
zh_hans: 没有可启动的内容

# Workload_Text_OK_565339
source: OK
zh_hans: 确定

# Workload_Text_Objects_are_created_in_the_namespace_a0a1e5
source: Objects are created in the namespace defined in the manifest, or "default" if none is specified.
zh_hans: 对象会创建在清单指定的命名空间中；未指定时使用“default”。

# Workload_Text_One_click_stacks_launch_a_common_13d658
source: One-click stacks — launch a common image or multi-service project in seconds.
zh_hans: 一键启动常用镜像或多服务项目。

# Workload_Text_Open_Terminal_ae088e
source: Open Terminal
zh_hans: 打开终端

# Workload_Text_Open_WebUI_needs_a_model_to_121755
source: Open WebUI needs a model to chat with. {0} is a good starting point — small and quick to download. You can type any Ollama model name instead, or add more later from the web UI.
zh_hans: Open WebUI 需要模型才能对话。{0} 体积小、下载快，适合开始使用。也可输入任意 Ollama 模型名称，或稍后通过网页界面添加模型。

# Workload_Text_Open_in_browser_62a2dc
source: Open in browser
zh_hans: 在浏览器中打开

# Workload_Text_Open_workspace_folder_546afd
source: Open workspace folder
zh_hans: 打开工作区文件夹

# Workload_Text_Operation_0f044f
source: Operation
zh_hans: 操作

# Workload_Text_PORTS_815390
source: PORTS
zh_hans: 端口

# Workload_Text_PROJECT_d1fb40
source: PROJECT
zh_hans: 项目

# Workload_Text_Partial_0_1_instances_ce3931
source: Partial ({0}/{1} instances)
zh_hans: 部分运行（{0}/{1} 个实例）

# Workload_Text_Pass_all_GPUs_gpus_all_9b7a66
source: Pass all GPUs (--gpus all)
zh_hans: 传递所有 GPU（--gpus all）

# Workload_Text_Password_token_051a24
source: Password / token
zh_hans: 密码 / 令牌

# Workload_Text_Password_token_optional_5caf4d
source: Password / token (optional)
zh_hans: 密码 / 令牌（可选）

# Workload_Text_Paste_a_Kubernetes_manifest_here_or_1bbcea
source: Paste a Kubernetes manifest here, or browse for a .yaml file.
zh_hans: 在此粘贴 Kubernetes 清单，或浏览 .yaml 文件。

# Workload_Text_Paste_a_docker_run_command_777185
source: Paste a docker run command
zh_hans: 粘贴 docker run 命令

# Workload_Text_PersistentVolumeClaim_2209d7
source: PersistentVolumeClaim
zh_hans: 持久卷声明

# Workload_Text_Persistent_Volume_Claims_fc9d77
source: Persistent Volume Claims
zh_hans: 持久卷声明

# Workload_Text_Pick_a_docker_compose_yml_or_b779be
source: Pick a docker-compose.yml (or .yaml) from disk. A sibling .env file and relative env_file paths are read from the same folder. Imported from the Compose page, the project keeps its depends_on order, restart and healthcheck policies (enforced by this app while it runs), environment interpolation, and resource limits. Imported from the Images/Containers page, each service is saved as a standalone run profile instead.
zh_hans: 从磁盘选择 docker-compose.yml（或 .yaml）。同目录的 .env 文件和相对 env_file 路径也将读取。从“Compose”页面导入时，项目会保留 depends_on 顺序、重启和健康检查策略（由本应用运行期间执行）、环境变量插值和资源限制。从“镜像”或“容器”页面导入时，各服务将保存为独立的运行配置。

# Workload_Text_Pick_a_template_to_get_started_e1abfd
source: Pick a template to get started.
zh_hans: 选择一个模板以开始。

# Workload_Text_Pods_9836b5
source: Pods
zh_hans: Pod

# Workload_Text_Port_Forwarding_2f9a49
source: Port Forwarding
zh_hans: 端口转发

# Workload_Text_Port_forward_failed_8e0e0e
source: Port forward failed
zh_hans: 端口转发失败

# Workload_Text_Port_in_use_3bb735
source: Port in use
zh_hans: 端口已占用

# Workload_Text_Port_mappings_one_per_line_host_a15d8a
source: Port mappings (one per line: host:container[/proto])
zh_hans: 端口映射（每行一个：host:container[/proto]）

# Workload_Text_Ports_0_f9a220
source: Ports: {0}
zh_hans: 端口：{0}

# Workload_Text_Ports_one_per_line_host_container_c09caa
source: Ports (one per line, host:container)
zh_hans: 端口（每行一个 host:container）

# Workload_Text_Prepare_for_pushing_to_a_registry_69afc1
source: Prepare for pushing to a registry (optional)
zh_hans: 准备推送到镜像仓库（可选）

# Workload_Text_Probe_type_0ee53b
source: Probe type
zh_hans: 探针类型

# Workload_Text_Profile_name_d36632
source: Profile name
zh_hans: 配置名称

# Workload_Text_Project_name_254981
source: Project name
zh_hans: 项目名称

# Workload_Text_Project_name_optional_16ad4a
source: Project name (optional)
zh_hans: 项目名称（可选）

# Workload_Text_Pull_b66d04
source: Pull
zh_hans: 拉取

# Workload_Text_Pull_image_77733e
source: Pull image
zh_hans: 拉取镜像

# Workload_Text_Push_731ce7
source: Push
zh_hans: 推送

# Workload_Text_Push_image_7d7dad
source: Push image
zh_hans: 推送镜像

# Workload_Text_Push_to_a503aa
source: Push to
zh_hans: 推送到

# Workload_Text_READY_c2e3ac
source: READY
zh_hans: 就绪

# Workload_Text_RESTARTS_5818db
source: RESTARTS
zh_hans: 重启次数

# Workload_Text_ROLES_d4af87
source: ROLES
zh_hans: 角色

# Workload_Text_Ready_5fa7aa
source: Ready
zh_hans: 就绪

# Workload_Text_Reason_0_2fa689
source: Reason: {0}
zh_hans: 原因：{0}

# Workload_Text_Rebuild_95aefb
source: Rebuild
zh_hans: 重新构建

# Workload_Text_Rebuild_failed_8da927
source: Rebuild failed
zh_hans: 重新构建失败

# Workload_Text_Rebuild_images_when_applying_6434fd
source: Rebuild images when applying
zh_hans: 应用时重新构建镜像

# Workload_Text_Rebuild_no_cache_b182f5
source: Rebuild (no cache)
zh_hans: 重新构建（不使用缓存）

# Workload_Text_Rebuilding_c3a834
source: Rebuilding
zh_hans: 正在重新构建

# Workload_Text_Rebuilding_without_cache_1f1e26
source: Rebuilding without cache
zh_hans: 正在重新构建（不使用缓存）

# Workload_Text_Recognized_flags_ports_env_volumes_name_371bc3
source: Recognized flags (ports, env, volumes, --name, --network, -w, -u, --entrypoint, --gpus, and more) prefill the Run dialog. Line-continuation backslashes are fine. Anything that can't be represented is reported and skipped.
zh_hans: 可识别的参数（端口、环境变量、数据卷、--name、--network、-w、-u、--entrypoint、--gpus 等）将预填到运行对话框中。支持使用反斜杠续行。无法表示的内容会报告并跳过。
